@daroga0002 

**Set worker groups as Launch Template:**
```
worker_groups_launch_template = local.worker_groups_launch_template
```

**Worker Groups Launch Template definition:**

```
locals {
  worker_groups_launch_template = [
    {
      name                 = "x86_64-01-SPOT"
      instance_type        = "m5a.large"
      spot_price           = "0.0469"
      spot_max_price       = "0.0669"
      asg_min_size         = 3
      asg_max_size         = 25
      asg_desired_capacity = 18
      suspended_processes  = ["AZRebalance"]
      root_volume_size     = 50
      root_volume_type     = "gp3"
      tags = [
        {
          "key"                 = "k8s.io/cluster-autoscaler/${local.account}-eks"
          "value"               = "owned"
          "propagate_at_launch" = true
        },
        {
          "key"                 = "k8s.io/cluster-autoscaler/enabled"
          "value"               = true
          "propagate_at_launch" = true
        }
      ]
    }
  ]
}
```
**Terraform plan output:**

```

Terraform will perform the following actions:


  # module.eks.aws_autoscaling_group.workers_launch_template[0] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 18
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 25
      + metrics_granularity       = "1Minute"
      + min_size                  = 3
      + name                      = (known after apply)
      + name_prefix               = "bm-dmz-tst-eks-x86_64-01-SPOT"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-0415c0b60c1238a71",
          + "subnet-0510163ce193147a6",
          + "subnet-0bd5a273bdffe9887",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "bm-dmz-tst-eks-x86_64-01-SPOT-eks_asg"
        }
      + tag {
          + key                 = "application"
          + propagate_at_launch = true
        }
    }

  # module.eks.aws_iam_instance_profile.workers_launch_template[0] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "bm-dmz-tst-eks"
      + path        = "/"
      + role        = "bm-dmz-tst-eks20210216075741214200000009"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }


  # module.eks.aws_launch_template.workers_launch_template[0] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "true"
      + id              = (known after apply)
      + image_id        = "ami-0d2afa4f076e34650"
      + instance_type   = "m5a.large"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "bm-dmz-tst-eks-x86_64-01-SPOT"
      + user_data       = "xxxx"

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "false"
              + iops                  = 0
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + security_groups             = [
              + "sg-0cdc0fbfe5a37abeb",
            ]
        }
    }


  # module.eks.random_pet.workers_launch_template[0] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }



```

As You can see there is lack of spot settings in plan output.